In [1]:
from sqlalchemy import create_engine

%load_ext sql

drivername = "postgresql"
username = "postgres"
password = "postgres"
host = "localhost"
port = "5432"
database = "analysis"

db_url = f"{drivername}://{username}:{password}@{host}/{database}"
engine = create_engine(db_url)

%sql engine

In [2]:
%%sql
CREATE TABLE teachers (
    id bigserial,
    first_name varchar(25),
    last_name varchar(50),
    school varchar(50),
    hire_date date,
    salary numeric
);

Running query in 'postgresql://postgres:***@localhost/analysis'

++
||
++
++

In [3]:
%%sql
INSERT INTO teachers (first_name, last_name, school, hire_date, salary)
VALUES ('Janet', 'Smith', 'F.D. Roosevelt HS', '2011-10-30', 36200),
       ('Lee', 'Reynolds', 'F.D. Roosevelt HS', '1993-05-22', 65000),
       ('Samuel', 'Cole', 'Myers Middle School', '2005-08-01', 43500),
       ('Samantha', 'Bush', 'Myers Middle School', '2011-10-30', 36200),
       ('Betty', 'Diaz', 'Myers Middle School', '2005-08-30', 43500),
       ('Kathleen', 'Roush', 'F.D. Roosevelt HS', '2010-10-22', 38500);

Running query in 'postgresql://postgres:***@localhost/analysis'

6 rows affected.

++
||
++
++

In [4]:
%%sql
select * from teachers;

Running query in 'postgresql://postgres:***@localhost/analysis'

6 rows affected.

+----+------------+-----------+---------------------+------------+--------+
| id | first_name | last_name |        school       | hire_date  | salary |
+----+------------+-----------+---------------------+------------+--------+
| 1  |   Janet    |   Smith   |  F.D. Roosevelt HS  | 2011-10-30 | 36200  |
| 2  |    Lee     |  Reynolds |  F.D. Roosevelt HS  | 1993-05-22 | 65000  |
| 3  |   Samuel   |    Cole   | Myers Middle School | 2005-08-01 | 43500  |
| 4  |  Samantha  |    Bush   | Myers Middle School | 2011-10-30 | 36200  |
| 5  |   Betty    |    Diaz   | Myers Middle School | 2005-08-30 | 43500  |
| 6  |  Kathleen  |   Roush   |  F.D. Roosevelt HS  | 2010-10-22 | 38500  |
+----+------------+-----------+---------------------+------------+--------+

In [5]:
%sqlcmd tables

+----------+
|   Name   |
+----------+
| teachers |
+----------+

In [6]:
%sqlcmd columns --table teachers

+------------+-------------+----------+--------------------------------------+---------------+---------+
|    name    |     type    | nullable |               default                | autoincrement | comment |
+------------+-------------+----------+--------------------------------------+---------------+---------+
|     id     |    BIGINT   |  False   | nextval('teachers_id_seq'::regclass) |      True     |   None  |
| first_name | VARCHAR(25) |   True   |                 None                 |     False     |   None  |
| last_name  | VARCHAR(50) |   True   |                 None                 |     False     |   None  |
|   school   | VARCHAR(50) |   True   |                 None                 |     False     |   None  |
| hire_date  |     DATE    |   True   |                 None                 |     False     |   None  |
|   salary   |   NUMERIC   |   True   |                 None                 |     False     |   None  |
+------------+-------------+----------+--------------------------------------+---------------+---------+